{
  "dados": [
    {
      "id": 360048527194,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Ensino Básico - Atualização dos dados pessoais do pai e da mãe dentro do portal do aluno",
      "Votos Internos": 1,
      "Votos Externos ": 3,
      "Votos totais": 4,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 3,
      "Status": "Não planejada",
      "Participativo": "Sim",
      "Data criação": "2020-07-13T17:25:41.000Z13/07/2020",
      "Data alteração": "2021-02-25T16:27:46.000Z25/02/2021",
      "comoEstaHoje": "Atualmente os pais enviam por e-mails e os dados são alterados/cadastrados manualmente no sistema.",
      "oQuePodeMudar": "Os pais vão ter autonomia de cadastrar/alterar os dados.",
      "valorDaEntrega": "Rapidez e agilidade no processo."
    },
    {
      "id": 360049289514,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Comprovante inscrição atividade ofertada",
      "Votos Internos": 0,
      "Votos Externos ": 0,
      "Votos totais": 0,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2020-08-19T16:28:45.000Z19/08/2020",
      "Data alteração": "2021-02-25T17:02:46.000Z25/02/2021",
      "comoEstaHoje": "Hoje não tem a funcionalidade.",
      "oQuePodeMudar": "Possibilitar que o aluno ao se inscrever em uma atividade ofertada possa gerar um comprovante desta inscrição, podendo ser esse comprovante um relatório do RM Reports.",
      "valorDaEntrega": "Maior confiança do aluno que a sua inscrição foi realizada com sucesso."
    },
    {
      "id": 360049383134,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Matrícula em disciplinas eletivas",
      "Votos Internos": 0,
      "Votos Externos ": 2,
      "Votos totais": 2,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Não planejada",
      "Participativo": "Não",
      "Data criação": "2020-08-26T14:50:09.000Z26/08/2020",
      "Data alteração": "2024-03-04T14:16:05.000Z04/03/2024",
      "comoEstaHoje": "O aluno é matriculado em todas as disciplinas, independente se estiver classificada como eletiva.",
      "oQuePodeMudar": "Atualmente para o processo de Rematrícula e o de Enturmação a aplicação não dá possibilidade de realizarmos a opção da disciplina. Todos os alunos são automaticamente matriculados em todas as disciplinas da turma.Como a opção ocorre após o início do período letivo o aluno tem sido matriculado em todas as opções.Entretanto entendemos que um dos processos poderia nos permitir não escolher a eletivas durante a rematrícula ou enturmação para que a secretaria em momento oportuno o fizesse.",
      "valorDaEntrega": "Retrabalho manual de ficar excluindo disciplina aluno por aluno."
    },
    {
      "id": 360051274314,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Assinatura eletrônica tokenizada de todos os contratos de serviços e documentos da instituição",
      "Votos Internos": 0,
      "Votos Externos ": 5,
      "Votos totais": 5,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 3,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2020-11-11T21:49:00.000Z11/11/2020",
      "Data alteração": "2025-05-26T21:53:04.000Z26/05/2025",
      "comoEstaHoje": "Atualmente é possível assinar eletronicamente com token apenas a matrícula online.",
      "oQuePodeMudar": "Possibilidade de assinatura eletrônica tokenizada de outros documentos e/ou serviços oferecidos pela instituição.",
      "valorDaEntrega": "A instituição possui diversos outros documentos que precisam de assinatura, sendo eles contratos de serviços extras oferecidos ou mesmo formulários como alteração de responsável financeiro ou ficha médica, no qual a assinatura também é fundamental.Tendo todos os documentos disponíveis para assinatura online, digitalizaria ainda mais a Secretaria Acadêmica e otimizaria bastante o trabalho, além de ser um facilitador para os alunos e responsáveis que terão a parte burocrática simplificada e sequer precisariam sair de casa."
    },
    {
      "id": 360051274594,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Webservice - retorno de erro de fórmula visual",
      "Votos Internos": 0,
      "Votos Externos ": 3,
      "Votos totais": 3,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2020-11-11T22:38:54.000Z11/11/2020",
      "Data alteração": "2021-02-25T19:28:06.000Z25/02/2021",
      "comoEstaHoje": "Utilizando o webservice wsFormulaVisual, no momento em que a fórmula visual apresenta erro, até mesmo pela atividade 'gerar exceção', o retorno pelo webservice é 'Nulo' e não o erro tratado pela exceção, como por exemplo, 'Usuário sem permissão...', 'Processo pendente...'. O erro genérico dificulta a análise do problema, na qual pode até mesmo ser  ocasionados por falha da estrutura da FV.",
      "oQuePodeMudar": "Retornar exatamente o erro da fórmula visual, exibindo erros de falha de estrutura ou especificar o erro tratado na exceção.",
      "valorDaEntrega": "Alertas claros para o cliente ou utilizador da ferramenta;\nInteligência na aplicação, obtendo tratamentos específicos nos processos envolvidos; \n \n\n \n \nAtenção não mude os dados abaixo"
    },
    {
      "id": 360051318854,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Controle da Frequência para atividades complementares",
      "Votos Internos": 0,
      "Votos Externos ": 1,
      "Votos totais": 1,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2020-11-17T19:13:15.000Z17/11/2020",
      "Data alteração": "2021-02-25T18:01:02.000Z25/02/2021",
      "comoEstaHoje": "Hoje o controle é apenas via sistema , flagando um campo que indica que o aluno cursou ou não determinada atividade.",
      "oQuePodeMudar": "Como o professor já pode ser vinculado a atividade complementar aplicada , ele poderia ter acesso via portal para controlar a frenquencia dos alunos inscritos nas atividades.",
      "valorDaEntrega": null
    },
    {
      "id": 1500000821962,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Curricularização da Extensão - Resolução nº7 de 18 de dezembro de 2018",
      "Votos Internos": 0,
      "Votos Externos ": 2,
      "Votos totais": 2,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2021-04-20T20:34:23.000Z20/04/2021",
      "Data alteração": "2021-12-15T19:24:15.000Z15/12/2021",
      "comoEstaHoje": "hoje o sistema não atende aos artigos 15 e 16 da resolução nº7 de 18 de dezembro de 2018 que Estabelece as Diretrizes para a Extensão na Educação Superior Brasileira.",
      "oQuePodeMudar": "Para atender aos artigos supracitados da resolução, mais especificamente o parágrafo único do artigo 15, o qual diz que 'as atividades de extensão devem ser sistematizadas e acompanhadas, com o adequado assentamento, além de registradas, fomentadas e avaliadas por instâncias administrativas institucionais (...)' , precisamos que as atividades que venham a ser oferecidas pelo GLA RM para esse papel específico 'Atividades de Extensão' possam nos proporcionar as seguintes funcionalidades:\n\n\nCadastro da Atividade (com descrição, carga horária, disciplina vinculada, professores associados, alunos participantes, instituições envolvidas);\nGerência da Atividade (com lançamento de frequência, lançamento de assentamentos (conteúdo) e avaliação final);\nEssas atividades devem ser devidamente registradas na Análise Curricular do aluno;\n\nHoje o cadastro das atividades curriculares do aluno atende em parte a essa necessidade, porém para atender ao que se pede precisaríamos que os três pontos acima fossem implementados.\n \n\nQuanto às atividades de extensão cursadas pelos alunos, conforme entendimento do Art. 4º da resolução que trata as atividades de extensão como um componente curricular que deve '(...) compor, no mínimo, 10% (dez por cento) do total da carga horária curricular estudantil dos cursos de graduação, as quais deverão fazer parte da matriz curricular dos cursos', fosse distinta da informação reservada às atividades curriculares já presentes na Análise Curricular de cada aluno, com um campo específico para esse fim. Conforme sugestão abaixo:\n \nHoje:\n\n \nSugestão:",
      "valorDaEntrega": "Com essa entrega poderíamos de fato executar o que é exigido nos artigos 15 e 16 da resolução nº7.\n\n \n \nAtenção não mude os dados abaixo"
    },
    {
      "id": 1500001103821,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "GLOBAIS RM - CRIAR FILTRO TELA PERMISSÕES DE ACESSO (não tem no MENU da CENTRAL), então abri aqui!",
      "Votos Internos": 0,
      "Votos Externos ": 0,
      "Votos totais": 0,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 3,
      "Status": "Respondida",
      "Participativo": "Não",
      "Data criação": "2021-05-25T17:09:09.000Z25/05/2021",
      "Data alteração": "2021-06-10T20:48:37.000Z10/06/2021",
      "comoEstaHoje": "Sem filtro, tenho aproximadamente 25.000 usuários na tela (degrada a performance)...",
      "oQuePodeMudar": "Criar um filtro para pegar por perfis ativos, usuários ativos, etc.. (limitando a visão e organizando melhor os dados na tela).",
      "valorDaEntrega": "Melhoria na performance do sistema/tela, não existem problemas, apenas benefícios."
    },
    {
      "id": 4404292597783,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "GLA RH > Linha RM > Folha Educacional > Liberação Templates - Engine Cópia Entre Coligadas",
      "Votos Internos": 0,
      "Votos Externos ": 0,
      "Votos totais": 0,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2021-07-15T00:24:07.000Z15/07/2021",
      "Data alteração": "2025-05-26T22:15:22.000Z26/05/2025",
      "comoEstaHoje": null,
      "oQuePodeMudar": "Liberação do template da tabela de Folha Educacional para que todos possam utilizar o NOVO recurso de Engine de Cópia de Coligadas. Solicito a liberação da tabela mostrada abaixo pois assim, acredito que facilitaria a análise e liberação do template:- Folha Educacional | Cadastros | Período Letivo- Folha Educacional | Cadastros | Turmas- Folha Educacional | Cadastros | Disciplinas- Folha Educacional | Cadastros | Função de Professor- Folha de Pagamento | Configurações | Parametrizador | Integrações | Gestão Educacional",
      "valorDaEntrega": "Recurso MARAVILHOSO e FUNCIONAL que TODOS os módulos do ERP-RM deveriam aderir em suas respectivas tabelas.Os clientes que trabalham com múltiplas coligadas, como é o caso por exemplo, dos segmentos de construção civil e escritórios de contabilidade poderiam se beneficiar com os ganhos de padronização, performance, segurança processual e agilidade que esta nossa funcionalidade possibilita através da automatização do processo de cópia de dados entre coligadas quando houver alteração de parâmetros ou com a criação de novas coligadas.OBS: Demanda aberta conforme alinhamento interno (Dev/PO/CO, etc)"
    },
    {
      "id": 4408405277335,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Considerar código do INEP do cadastro do curso do MEC vinculado a matriz curricular para geração do CENSO.",
      "Votos Internos": 4,
      "Votos Externos ": 2,
      "Votos totais": 6,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 2,
      "Status": "Concluída",
      "Participativo": "Não",
      "Data criação": "2021-09-13T17:53:27.000Z13/09/2021",
      "Data alteração": "2025-05-21T21:31:13.000Z21/05/2025",
      "comoEstaHoje": "O código do INEP considerado para geração do CENSO é inserido dentro do cadastro do curso.",
      "oQuePodeMudar": "Considerar para geração do CENSO o código do INEP do cadastro do curso do MEC associado a matriz aplicada, já que para o CENSO o código é diferente por localidade.",
      "valorDaEntrega": "O cliente poderá utilizar a mesma estrutura de curso e matrizes curriculares para atender várias filiais do mesmo nível de ensino.Se utilizarmos o código do INEP no curso do MEC vinculado a matriz aplicada este que deveria ser considerado para geração do arquivo para o CENSO."
    },
    {
      "id": 4410616534551,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Possibilidade de considerar também, na cópia da oferta, as turmas inativas do período letivo atual",
      "Votos Internos": 0,
      "Votos Externos ": 4,
      "Votos totais": 4,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 0,
      "Status": "Sem Status",
      "Participativo": "Não",
      "Data criação": "2021-10-13T15:07:32.000Z13/10/2021",
      "Data alteração": "2021-11-03T13:13:52.000Z03/11/2021",
      "comoEstaHoje": "atualmente o processo \"Copiar matriz aplicada para outro período letivo\", executado a partir da parametrização por curso, não considera as turmas e turmas disciplinas inativas para serem copiadas para o próximo período letivo. Ou seja, as instituições não tem a possibilidade de escolher se desejam copiar as turmas inativas ou não, é regra fixa do sistema para não copiá-las.",
      "oQuePodeMudar": "flexibilizar, através de um parâmetro, para que as instituições escolham, na hora de realizar o processo, se desejam copiar ou não as turmas e turmas disciplinas inativas para o próximo período letivo.",
      "valorDaEntrega": "flexibilidade e agilidade em um processo que é muito complicado para todas as instituições de ensino, principalmente no Ensino Superior. Algumas turmas são inativadas em um semestre mas serão ativadas no seguinte. Como elas não são copiadas, existe um trabalho gigantesco e manual para recuperar e criar manualmente estas turmas. Este é um dos processos mais complexos e manualizados nas IES e precisa de uma"
    },
    {
      "id": 4410831457815,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Censo Ensino Superior - PARFOR - apoio para preenchimento dessa informação em lote",
      "Votos Internos": 0,
      "Votos Externos ": 5,
      "Votos totais": 5,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Respondida",
      "Participativo": "Não",
      "Data criação": "2021-10-16T01:58:03.000Z16/10/2021",
      "Data alteração": "2025-05-21T22:20:05.000Z21/05/2025",
      "comoEstaHoje": "Atualmente, é possível apenas estabelecer um default geral para o campo complementar PARFOR. Contudo, tal sinalização deve ser feita apenas em cursos de Licenciatura. Há instituições que não participam desse programa. Há ainda instituições que participam, mas PARFOR não se aplica para todos os cursos de sua instituição. É preciso entrar aluno por aluno com vínculo em cursos de Licenciatura e informar valor para esse campo no curso/habilitação do aluno. Essa informação não é requerida para alunos de cursos de Bacharelado.",
      "oQuePodeMudar": "Poder contar com um processo que atualize essa informação em lote e não aluno por aluno. Que seja possível estabelecer um filtro de um conjunto de alunos de curso de Licenciatura para então aplicar o valor que se deseja: 0 (Não) ou 1 (Sim).",
      "valorDaEntrega": "Agilidade para o processo de preparação dos dados para o Censo. Autonomia das áreas usuárias."
    },
    {
      "id": 4412573450647,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Cadastrar os Dados do Censo em lote",
      "Votos Internos": 0,
      "Votos Externos ": 0,
      "Votos totais": 0,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 1,
      "Status": "Respondida",
      "Participativo": "Não",
      "Data criação": "2021-11-08T19:28:45.000Z08/11/2021",
      "Data alteração": "2025-05-21T22:32:16.000Z21/05/2025",
      "comoEstaHoje": "o Assistente de Polo cadastra as horas complementares em lote de alguns eventos, contudo o cadastro nos dados do Censo Escolar precisa ser realizado aluno por aluno.",
      "oQuePodeMudar": "dentro desta ferramenta solicitamos que seja possível, ao cadastrar as horas complementares em lote, incluir os Dados do Censo Escolar também em lote, pois se a atividade é de Extensão, essa informação deve constar para cada aluno.",
      "valorDaEntrega": "com essa melhoria o processo se tornará muito mais otimizado e prático para os Assistentes, pois atualmente geramos o CUBO que retorna os alunos em que não consta o cadastro nos Dados do Censo Escolar e geralmente são estes casos de lançamento de horas em lote."
    },
    {
      "id": 4414113774743,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Atividade complementar no Ensino Superior",
      "Votos Internos": 0,
      "Votos Externos ": 2,
      "Votos totais": 2,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 2,
      "Status": "Respondida",
      "Participativo": "Sim",
      "Data criação": "2021-11-25T15:51:43.000Z25/11/2021",
      "Data alteração": "2025-05-22T16:37:50.000Z22/05/2025",
      "comoEstaHoje": "Não conseguimos:a) permitir que o estudante faça upload dos comprovantes das atividades que participou;b) deferir ou indeferir a carga horária de cada atividade a partir do comprovante enviado pelo estudante;c) distribuir uma atividade em categorias (Tecnologia e inovação, Sustentabilidade, etc) e nem definir a carga horário por categoria, bem como informar a obrigatoriedade;d) fazer o estudante acompanhar o saldo de carga horária realizada e pendente por categoria.",
      "oQuePodeMudar": "a) permitir ao estudante fazer o upload dos comprovantes (documentos) por atividade e categoria;b) permitir acompanhar o saldo da carga horária realizada e pendente por atividade de categoria;c) permitir digitar o valor por carga horária e não como nota ou falta;d) criar um painel de acompanhamento para a coordenação do curso ou reitoria.",
      "valorDaEntrega": "a) padronização institucional para todos os cursos;b) facilidade para o estudante em seu acompanhamento acadêmico;c) redução de atendimento presencial para tal comprovação/acompanhamento;d) pro-atividade por parte da Equipe Pedagógica"
    },
    {
      "id": 4420119193367,
      "Titulo": "GLA Education > Gestão Acadêmica > Atividades Ofertadas",
      "Detalhe": "Melhoria da Função para inclusão de Níveis de Ensino",
      "Votos Internos": 0,
      "Votos Externos ": 2,
      "Votos totais": 2,
      "Votos Negativos": 0,
      "Quantidade de Comentarios": 0,
      "Status": "Sem Status",
      "Participativo": "Não",
      "Data criação": "2022-01-24T14:28:12.000Z24/01/2022",
      "Data alteração": "2022-03-29T17:14:38.000Z29/03/2022",
      "comoEstaHoje": "Precisamos de um recurso mais prático para inclusão de filiais para nossos usuários, hoje manualmente esta sendo um a um.",
      "oQuePodeMudar": "Hoje temos 22 Coligadas e 73 Filiais, esta ficando impraticável incluir uma a uma para nossos usuários. Estávamos utilizando o recurso de copia de usuário do Educacional, porém hoje nossa auditoria não permite que utilizemos este recurso, Neste caso gostaria de pedir uma solução para agilizar este processo.Segue print para melhor entendimento, caso ja tenha alguma forma mais prática de realizar o procedimento será bem vinda. Acredito que apenas incluindo o check box de marcação ao lado de cada nível de ensino resolveria.",
      "valorDaEntrega": "Agilidade no processo com ganho de produtividade e também evitar erro de concessões de acessos indevidos uma vez que como são muitas filiais a tela fica muito poluída a medida que as filiais são incluídas."
    }
  ]
}